test/stress/get_report_c1.txt
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/v1/user_banner?feature_id=1&tag_id=1
Document Length:        43 bytes

Concurrency Level:      1
Time taken for tests:   0.572 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      151000 bytes
HTML transferred:       43000 bytes
Requests per second:    1749.25 [#/sec] (mean)
Time per request:       0.572 [ms] (mean)
Time per request:       0.572 [ms] (mean, across all concurrent requests)
Transfer rate:          257.95 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     0    0   0.4      0      13
Waiting:        0    0   0.4      0      13
Total:          0    1   0.4      1      13

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      1
  98%      1
  99%      1
 100%     13 (longest request)